-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- 主机： 127.0.0.1
-- 生成日期： 2020-11-25 07:06:37
-- 服务器版本： 10.3.16-MariaDB
-- PHP 版本： 7.3.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `egg`
--

-- --------------------------------------------------------

--
-- 表的结构 `weight`
--

CREATE TABLE `weight` (
  `id` int(11) NOT NULL,
  `weighType` int(11) DEFAULT NULL,
  `weighNo` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `weighName` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `garbageType` int(11) NOT NULL,
  `weight` double DEFAULT NULL,
  `unit` int(11) NOT NULL,
  `time` timestamp NOT NULL DEFAULT current_timestamp(),
  `weightMode` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 转存表中的数据 `weight`
--

INSERT INTO `weight` (`id`, `weighType`, `weighNo`, `weighName`, `garbageType`, `weight`, `unit`, `time`, `weightMode`, `created_at`) VALUES
(1, 3, 'no123456789', 'goodluck', 4, 5.5, 1, '2020-11-21 01:16:06', 1, '2020-11-21 03:04:17'),
(2, 3, 'no135792468', 'kitty', 4, 9.9, 1, '2020-11-21 01:16:06', 1, '2020-11-21 03:04:17'),
(3, 3, 'no123456789', 'goodluck', 4, 5.5, 1, '2020-11-21 01:16:21', 1, '2020-11-21 03:04:17'),
(4, 3, 'no135792468', 'kitty', 4, 9.9, 1, '2020-11-21 01:16:21', 1, '2020-11-21 03:04:17'),
(5, 3, 'no123456789', 'goodluck', 4, 5.5, 1, '2020-11-21 01:16:26', 1, '2020-11-21 03:04:17'),
(6, 3, 'no135792468', 'kitty', 4, 9.9, 1, '2020-11-21 01:16:26', 1, '2020-11-21 03:04:17'),
(7, 3, 'no123456789', 'goodluck', 4, 5.5, 1, '2020-11-21 01:16:30', 1, '2020-11-21 03:04:17'),
(8, 3, 'no135792468', 'kitty', 4, 9.9, 1, '2020-11-21 01:16:30', 1, '2020-11-21 03:04:17'),
(9, 3, 'no123456789', 'goodluck', 4, 5.5, 1, '2020-11-21 01:16:33', 1, '2020-11-21 03:04:17'),
(10, 3, 'no135792468', 'kitty', 4, 9.9, 1, '2020-11-21 01:16:33', 1, '2020-11-21 03:04:17'),
(11, 3, 'no123456789', 'goodluck', 4, 5.5, 1, '2020-11-21 01:16:36', 1, '2020-11-21 03:04:17'),
(12, 3, 'no135792468', 'kitty', 4, 9.9, 1, '2020-11-21 01:16:36', 1, '2020-11-21 03:04:17'),
(13, 3, 'noabcdefg', 'hello', 4, 8.8, 1, '2020-11-21 06:31:49', 1, '2020-11-21 06:31:49'),
(14, 3, 'no9876543210', 'mongo', 4, 23.5, 1, '2020-11-21 06:35:13', 1, '2020-11-21 06:35:13'),
(15, 3, 'no9876543210', 'mongo', 4, 23.5, 1, '2020-11-21 07:00:47', 1, '2020-11-21 07:00:47'),
(16, 3, 'no9876543210', 'mongo', 4, 23.5, 1, '2020-11-21 07:01:31', 1, '2020-11-21 07:01:31'),
(17, 3, 'no9876543210', 'mongo', 4, 23.5, 1, '2020-11-21 07:59:30', 1, '2020-11-21 07:59:30'),
(18, 3, 'no9876543210', 'mongo', 4, 23.5, 1, '2020-11-21 08:01:51', 1, '2020-11-21 08:01:51'),
(19, 3, 'no9876543210', 'mongo', 4, 23.5, 1, '2020-11-21 08:05:03', 1, '2020-11-21 08:05:03'),
(20, 3, 'noabcdefg', 'goodluck', 4, 5.5, 1, '2020-11-24 06:54:49', 1, '2020-11-24 06:54:49'),
(21, 3, 'noabcdefg', 'goodluck', 4, 5.5, 1, '2020-11-24 06:59:39', 1, '2020-11-24 06:59:39'),
(22, 3, 'noabcdefg', 'goodluck', 4, 5.5, 1, '2020-11-24 06:59:56', 1, '2020-11-24 06:59:56'),
(23, 3, 'noabcdefg', 'hello', 4, 8.8, 1, '2020-11-24 07:10:02', 1, '2020-11-24 07:10:02'),
(24, 3, 'noabcdefg', 'hello', 4, 8.8, 1, '2020-11-24 07:10:40', 1, '2020-11-24 07:10:40'),
(25, 3, 'noabcdefg', 'hello', 4, 8.8, 1, '2020-11-24 07:52:18', 1, '2020-11-24 07:52:18'),
(26, 3, 'noabcdefg', 'hello', 4, 8.8, 1, '2020-11-24 07:55:10', 1, '2020-11-24 07:55:10'),
(27, 3, 'noabcdefg', 'hello', 4, 8.8, 1, '2020-11-24 08:09:54', 1, '2020-11-24 08:09:54'),
(28, 3, 'no123456789', 'hello', 4, 5.5, 1, '2020-11-25 02:02:37', 1, '2020-11-25 02:02:37'),
(29, 3, 'no123456789', 'hello', 4, 5.5, 1, '2020-11-25 02:02:54', 1, '2020-11-25 02:02:54'),
(30, 3, 'no123456789', 'hello', 4, 5.5, 1, '2020-11-25 02:03:24', 1, '2020-11-25 02:03:24'),
(31, 3, 'no9876543210', 'goodluck', 4, 8.8, 1, '2020-11-25 02:05:03', 1, '2020-11-25 02:05:03'),
(32, 3, 'no9876543210', 'goodluck', 4, 8.8, 1, '2020-11-25 02:05:27', 1, '2020-11-25 02:05:27'),
(33, 3, 'no9876543210', 'goodluck', 4, 8.8, 1, '2020-11-25 02:05:54', 1, '2020-11-25 02:05:54'),
(34, 3, 'no9876543210', 'goodluck', 4, 8.8, 1, '2020-11-25 02:06:15', 1, '2020-11-25 02:06:15'),
(35, 3, 'no9876543210', 'goodluck', 4, 8.8, 1, '2020-11-25 03:05:45', 1, '2020-11-25 03:05:45'),
(36, 3, 'no9876543210', 'goodluck', 4, 8.8, 1, '2020-11-25 03:05:57', 1, '2020-11-25 03:05:57'),
(37, 3, 'no9876543210', 'goodluck', 4, 8.8, 1, '2020-11-25 03:09:24', 1, '2020-11-25 03:09:24'),
(38, 3, 'no9876543210', 'goodluck', 4, 8.8, 1, '2020-11-25 03:15:07', 1, '2020-11-25 03:15:07'),
(39, 3, 'no9876543210', 'goodluck', 4, 8.8, 1, '2020-11-25 03:47:46', 1, '2020-11-25 03:47:46'),
(40, 3, 'no9876543210', 'goodluck', 4, 8.8, 1, '2020-11-25 05:29:23', 1, '2020-11-25 05:29:23');

--
-- 转储表的索引
--

--
-- 表的索引 `weight`
--
ALTER TABLE `weight`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `weight`
--
ALTER TABLE `weight`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
